import pytest

@pytest.fixture
def sample_card_numbers():
    """Фикстура с тестовыми номерами карт"""
    return [
        "7000792289606361",
        "1234567890123456",
        "5555444433332222",
        "0000111122223333"
    ]


@pytest.fixture
def sample_account_info():
    """Фикстура с тестовыми данными карт/счетов"""
    return [
        "Visa Platinum 7000792289606361",
        "Maestro 1596837868705199",
        "Счет 73654108430135874305",
        "MasterCard 7158300734726758",
        "Visa Classic 6831982476737658",
        "Visa Gold 5999414228426353",
        "счет 64686473678894779589",  # маленькая с
        "Cчет 35383033474447895560",  # латинская C
        "СЧЕТ 89992000333344445555"   # заглавные
    ]


@pytest.fixture
def sample_dates():
    """Фикстура с тестовыми датами"""
    return [
        "2024-03-11T02:26:18.671407",
        "2023-12-31T23:59:59.999999",
        "2025-01-01T00:00:00.000000",
        "2000-02-29T12:30:45.123456"
    ]


@pytest.fixture
def invalid_inputs():
    """Фикстура с некорректными данными"""
    return [
        "",  # пустая строка
        "123",  # слишком коротко
        "abc",  # не цифры
        "12345678901234567",  # слишком длинно
    ]